README.adoc

= Con Libre: simple API simulator for gematik Konnektor
ifdef::env-github[]
:imagesdir:https://raw.githubusercontent.com/spilikin/telematik-konemu/master/
:tip-caption: :bulb:
:note-caption: :information_source:
:important-caption: :heavy_exclamation_mark:
:caution-caption: :fire:
:warning-caption: :warning:
endif::[]
ifndef::env-github[]
:imagesdir: ./
endif::[]
:toc:
:toc-placement!:


image:mask.png[width=20%]

toc::[]

== Usage

----
gradle clean 
gradle bootRun
----

== Access ServiceDirectory

=== Request
[cols="h,m"] 
|===
|URI        |http://localhost:8080/connector.sds
|Method     |GET
|CURL       |curl -i http://localhost:8080/connector.sds
|===

=== Response
[source,xml]
----
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<ns2:ConnectorServices xmlns="http://ws.gematik.de/int/version/ProductInformation/v1.1" xmlns:ns2="http://ws.gematik.de/conn/ServiceDirectory/v3.1" xmlns:ns3="http://ws.gematik.de/conn/ServiceInformation/v2.0">
  <ns2:TLSMandatory>false</ns2:TLSMandatory>
  <ns2:ClientAutMandatory>false</ns2:ClientAutMandatory>
  <ns3:ServiceInformation>
    <ns3:Service Name="AuthSignatureService">
      <ns3:Versions>
        <ns3:Version TargetNamespace="http://ws.gematik.de/conn/AuthSignatureService/WSDL/v7.4" Version="7.4.0">
          <ns3:Endpoint Location="http://localhost:8080/soap-api/AuthSignatureService/7.4.0"/> <1>
        </ns3:Version>
      </ns3:Versions>
    </ns3:Service>
    <ns3:Service Name="EventService">
      <ns3:Versions>
        <ns3:Version TargetNamespace="http://ws.gematik.de/conn/EventService/WSDL/v7.2" Version="7.2.0">
          <ns3:Endpoint Location="http://localhost:8080/soap-api/EventService/7.2.0"/>
        </ns3:Version>
      </ns3:Versions>
    </ns3:Service>
    <ns3:Service Name="CardService">
      <ns3:Versions>
        <ns3:Version TargetNamespace="http://ws.gematik.de/conn/CardService/WSDL/v8.1" Version="8.1.1">
          <ns3:Endpoint Location="http://localhost:8080/soap-api/CardService/8.1.1"/>
        </ns3:Version>
      </ns3:Versions>
    </ns3:Service>
    <ns3:Service Name="CardService">
      <ns3:Versions>
        <ns3:Version TargetNamespace="http://ws.gematik.de/conn/CardService/WSDL/v8.1" Version="8.1.2">
          <ns3:Endpoint Location="http://localhost:8080/soap-api/CardService/8.1.2"/>
        </ns3:Version>
      </ns3:Versions>
    </ns3:Service>
  </ns3:ServiceInformation>
</ns2:ConnectorServices>
----

== Get all available Smartcards

=== Request

[cols="h,a"] 
|===
|URI        |http://localhost:8080/soap-api/EventService/7.2.0
|Method     |POST
|HTTP Header `SOAPAction` | `http://ws.gematik.de/conn/EventService/v7.2#GetCards`
|Payload    |
[source,xml]
----
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:GetCards xmlns:ns0="http://ws.gematik.de/conn/EventService/v7.2" mandant-wide="false">
      <ns1:Context xmlns:ns1="http://ws.gematik.de/conn/ConnectorContext/v2.0">
        <ns2:MandantId xmlns:ns2="http://ws.gematik.de/conn/ConnectorCommon/v5.0">MandantId</ns2:MandantId>
        <ns3:ClientSystemId xmlns:ns3="http://ws.gematik.de/conn/ConnectorCommon/v5.0">ClientSystemId</ns3:ClientSystemId>
        <ns4:WorkplaceId xmlns:ns4="http://ws.gematik.de/conn/ConnectorCommon/v5.0">WorkplaceId</ns4:WorkplaceId>
      </ns1:Context>
    </ns0:GetCards>
  </soap-env:Body>
</soap-env:Envelope>
----
|CURL       |
[source,bash]
----
curl http://localhost:8080/soap-api/EventService/7.2.0 \ 
  -X POST \
  --header 'SOAPAction: http://ws.gematik.de/conn/EventService/v7.2#GetCards' \
  --data '<soap-env:Envelope>...'
----
|===


=== Response
[source,xml]
----
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns3:GetCardsResponse xmlns="http://ws.gematik.de/conn/ConnectorCommon/v5.0" xmlns:ns2="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:ns3="http://ws.gematik.de/conn/EventService/v7.2" xmlns:ns4="http://ws.gematik.de/tel/error/v2.0" xmlns:ns5="http://ws.gematik.de/conn/CardServiceCommon/v2.0" xmlns:ns6="http://ws.gematik.de/conn/CardService/v8.1" xmlns:ns7="http://ws.gematik.de/int/version/ProductInformation/v1.1" xmlns:ns8="http://ws.gematik.de/conn/CardTerminalInfo/v8.0" xmlns:ns9="urn:oasis:names:tc:dss:1.0:core:schema" xmlns:ns10="http://www.w3.org/2000/09/xmldsig#" xmlns:ns11="urn:oasis:names:tc:SAML:1.0:assertion">
      <ns6:Cards>
        <ns6:Card>
          <CardHandle>smc-b_2</CardHandle>
          <ns5:CardType>SMC-B</ns5:CardType>
        </ns6:Card>
        <ns6:Card>
          <CardHandle>smc-b_1</CardHandle>
          <ns5:CardType>SMC-B</ns5:CardType>
        </ns6:Card>
      </ns6:Cards>
    </ns3:GetCardsResponse>
  </soap:Body>
</soap:Envelope>
----

== Verify PIN

=== Request

[cols="h,a"] 
|===
|URI        |http://localhost:8080/soap-api/CardService/8.1.2
|Method     |POST
|HTTP Header `SOAPAction` | `http://ws.gematik.de/conn/CardService/v8.1#VerifyPin`
|Payload    |
[source,xml]
----
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:VerifyPin xmlns:ns0="http://ws.gematik.de/conn/CardService/v8.1">
      <ns1:Context xmlns:ns1="http://ws.gematik.de/conn/ConnectorContext/v2.0">
        <ns2:MandantId xmlns:ns2="http://ws.gematik.de/conn/ConnectorCommon/v5.0">MandantId</ns2:MandantId>
        <ns3:ClientSystemId xmlns:ns3="http://ws.gematik.de/conn/ConnectorCommon/v5.0">ClientSystemId</ns3:ClientSystemId>
        <ns4:WorkplaceId xmlns:ns4="http://ws.gematik.de/conn/ConnectorCommon/v5.0">WorkplaceId</ns4:WorkplaceId>
      </ns1:Context>
      <ns5:CardHandle xmlns:ns5="http://ws.gematik.de/conn/ConnectorCommon/v5.0">smc-b_2</ns5:CardHandle>
      <ns6:PinTyp xmlns:ns6="http://ws.gematik.de/conn/CardServiceCommon/v2.0">PIN.SMC</ns6:PinTyp>
    </ns0:VerifyPin>
  </soap-env:Body>
</soap-env:Envelope>
----
|CURL       |
[source,bash]
----
curl http://localhost:8080/soap-api/CardService/8.1.2 \ 
  -X POST \
  --header 'SOAPAction: http://ws.gematik.de/conn/CardService/v8.1#VerifyPin' \
  --data '<soap-env:Envelope>...'
----
|===

=== Response

[source,xml]
----
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns4:VerifyPinResponse xmlns="http://ws.gematik.de/conn/ConnectorCommon/v5.0" xmlns:ns2="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:ns3="http://ws.gematik.de/conn/CardServiceCommon/v2.0" xmlns:ns4="http://ws.gematik.de/conn/CardService/v8.1" xmlns:ns5="http://ws.gematik.de/tel/error/v2.0" xmlns:ns6="urn:oasis:names:tc:dss:1.0:core:schema" xmlns:ns7="http://www.w3.org/2000/09/xmldsig#" xmlns:ns8="http://ws.gematik.de/int/version/ProductInformation/v1.1" xmlns:ns9="urn:oasis:names:tc:SAML:1.0:assertion">
      <Status/>
      <ns3:PinResult>OK</ns3:PinResult>
      <ns3:LeftTries>3</ns3:LeftTries>
    </ns4:VerifyPinResponse>
  </soap:Body>
</soap:Envelope>
----


== Call ExternalAuthenticate to sign challenge

=== Request

[cols="h,a"] 
|===
|URI        |http://localhost:8080/soap-api/AuthSignatureService/7.4.0
|Method     |POST
|HTTP Header `SOAPAction` | +http://ws.gematik.de/conn/SignatureService/v7.4#ExternalAuthenticate+
|Payload    |
[source,xml]
----
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:ExternalAuthenticate xmlns:ns0="http://ws.gematik.de/conn/SignatureService/v7.4">
      <ns1:CardHandle xmlns:ns1="http://ws.gematik.de/conn/ConnectorCommon/v5.0">smc-b_2</ns1:CardHandle>
      <ns2:Context xmlns:ns2="http://ws.gematik.de/conn/ConnectorContext/v2.0">
        <ns3:MandantId xmlns:ns3="http://ws.gematik.de/conn/ConnectorCommon/v5.0">MandantId</ns3:MandantId>
        <ns4:ClientSystemId xmlns:ns4="http://ws.gematik.de/conn/ConnectorCommon/v5.0">ClientSystemId</ns4:ClientSystemId>
        <ns5:WorkplaceId xmlns:ns5="http://ws.gematik.de/conn/ConnectorCommon/v5.0">WorkplaceId</ns5:WorkplaceId>
      </ns2:Context>
      <ns0:OptionalInputs>
        <ns6:SignatureType xmlns:ns6="urn:oasis:names:tc:dss:1.0:core:schema">urn:ietf:rfc:3447</ns6:SignatureType>
        <ns0:SignatureSchemes>RSASSA-PKCS1-v1_5</ns0:SignatureSchemes>
      </ns0:OptionalInputs>
      <ns0:BinaryString>
        <ns7:Base64Data xmlns:ns7="urn:oasis:names:tc:dss:1.0:core:schema">WVdKalpHVm1aMmhwYW10c2JXNXZjSEZ5YzNSMWRuZDRlWHBCUWtORVJVWT0=</ns7:Base64Data>
      </ns0:BinaryString>
    </ns0:ExternalAuthenticate>
  </soap-env:Body>
</soap-env:Envelope>
----
|CURL       |
[source,bash]
----
curl http://localhost:8080/soap-api/AuthSignatureService/7.4.0 \ 
  -X POST \
  --header 'SOAPAction: http://ws.gematik.de/conn/SignatureService/v7.4#ExternalAuthenticate' \
  --data '<soap-env:Envelope>...'
----
|===

   Address: 
    HttpMethod: POST
    Content-Type: text/xml; charset=utf-8
    ExchangeId: edd65233-3496-4d02-a1b5-00b04f613fe9
    ServiceName: AuthSignatureServiceService
    PortName: AuthSignatureServicePort
    PortTypeName: AuthSignatureServicePortType
    Headers: {SOAPAction="", Accept=*/*, host=localhost:8080, connection=keep-alive, content-type=text/xml; charset=utf-8, Content-Length=1176, accept-encoding=gzip, deflate, user-agent=Zeep/3.4.0 (www.python-zeep.org)}
    Payload: 


== Development

=== Toolchain installation

1. (optional) Install SDKMAN from http://sdkman.io
2. Install Java 11 and Gradle
----
sdk install java
sdk install gradle
----

.Generate RSA self signed certificates
----
openssl req -x509 -newkey rsa:2048 -keyout key.pem -out cert.pem -days 1825
openssl pkcs8 -topk8 -inform PEM -in key.pem -out privatekey.pem -nocrypt
----

.TODO: Generate ECC self signed certificates
----
openssl ...
----

